## Staging: performance-test
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`





```terraform
Plan: 3 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_event_target.ecs_scheduled_task will be created
  + resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
      + arn            = "arn:aws:ecs:ca-central-1:239043911459:cluster/performance_test_cluster"
      + event_bus_name = "default"
      + id             = (known after apply)
      + role_arn       = "arn:aws:iam::239043911459:role/performance_test_cluster-ecs-task"
      + rule           = "perf_test_event_rule"
      + target_id      = (known after apply)

      + ecs_target {
          + enable_ecs_managed_tags = false
          + enable_execute_command  = false
          + launch_type             = "FARGATE"
          + platform_version        = "1.4.0"
          + propagate_tags          = "TASK_DEFINITION"
          + task_count              = 1
          + task_definition_arn     = (known after apply)

          + network_configuration {
              + assign_public_ip = false
              + security_groups  = (known after apply)
              + subnets          = [
                  + "subnet-0c7d18c0c51b28b61",
                  + "subnet-0c91f7c6b8211904b",
                  + "subnet-0cecd9e634daf82d3",
                ]
            }
        }
    }

  # aws_ecs_task_definition.perf_test_task will be created
  + resource "aws_ecs_task_definition" "perf_test_task" {
      + arn                      = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + environment      = [
                      + {
                          + name  = "PERF_TEST_AWS_S3_BUCKET"
                          + value = "notify-performance-test-results-staging"
                        },
                      + {
                          + name  = "PERF_TEST_BULK_EMAIL_TEMPLATE_ID"
                          + value = "fa759679-30f2-4666-94e2-bd4921329c46"
                        },
                      + {
                          + name  = "PERF_TEST_CSV_DIRECTORY_PATH"
                          + value = "/tmp/notify_performance_test"
                        },
                      + {
                          + name  = "PERF_TEST_DOMAIN"
                          + value = "https://api.staging.notification.cdssandbox.xyz"
                        },
                      + {
                          + name  = "PERF_TEST_EMAIL"
                          + value = "success@simulator.amazonses.com"
                        },
                      + {
                          + name  = "PERF_TEST_EMAIL_TEMPLATE_ID"
                          + value = "fa759679-30f2-4666-94e2-bd4921329c46"
                        },
                      + {
                          + name  = "PERF_TEST_EMAIL_WITH_ATTACHMENT_TEMPLATE_ID"
                          + value = "fa759679-30f2-4666-94e2-bd4921329c46"
                        },
                      + {
                          + name  = "PERF_TEST_EMAIL_WITH_LINK_TEMPLATE_ID"
                          + value = "9fb324a5-821d-4b54-9d52-d9ba1fa8373a"
                        },
                      + {
                          + name  = "PERF_TEST_PHONE_NUMBER"
                          + value = "12897682684"
                        },
                      + {
                          + name  = "PERF_TEST_SMS_TEMPLATE_ID"
                          + value = "d5fea9f3-f69d-481e-9186-b7f4eaa5cf63"
                        },
                      + {
                          + name  = "TEST_AUTH_HEADER"
                          + value = "apikey-v1 7f6a1a4e-8b35-4b27-b205-0a70a8d36fbc"
                        },
                    ]
                  + essential        = true
                  + image            = "239043911459.dkr.ecr.ca-central-1.amazonaws.com/notify/performance-test"
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "performance_test_cluster"
                          + awslogs-region        = "ca-central-1"
                          + awslogs-stream-prefix = "performance_test_cluster-task"
                        }
                    }
                  + name             = "performance test"
                  + ulimits          = [
                      + {
                          + hardLimit = 98304
                          + name      = "nofile"
                          + softLimit = 98304
                        },
                    ]
                  + volumesFrom      = []
                },
            ]
        )
      + cpu                      = "2"
      + execution_role_arn       = "arn:aws:iam::239043911459:role/container_execution_role"
      + family                   = "performance_test_cluster"
      + id                       = (known after apply)
      + memory                   = "512"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + tags                     = {
          + "CostCentre" = "notification-canada-ca-staging"
        }
      + tags_all                 = {
          + "CostCentre" = "notification-canada-ca-staging"
        }
      + task_role_arn            = "arn:aws:iam::239043911459:role/performance_test_cluster-ecs-task"
    }

  # aws_security_group.perf_test will be created
  + resource "aws_security_group" "perf_test" {
      + arn                    = (known after apply)
      + description            = "Performance Test Security Group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "perf_test"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-097508d1f5e243195"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

Releasing state lock. This may take a few moments...

```

</details>